STMicroelectronics/STM32N6-GettingStarted-ReID/Application/NUCLEO-N657X0-Q/Src/main.c
 /**
 ******************************************************************************
 * @file    main.c
 * @author  GPM Application Team
 *
 ******************************************************************************
 * @attention
 *
 * Copyright (c) 2023 STMicroelectronics.
 * All rights reserved.
 *
 * This software is licensed under terms that can be found in the LICENSE file
 * in the root directory of this software component.
 * If no LICENSE file comes with this software, it is provided AS-IS.
 *
 ******************************************************************************
 */
#include <stdint.h>
#include <string.h>
#include <unistd.h>

#include "app_trackobject.h"
#include "cmw_camera.h"
#include "scrl.h"
#include "stm32n6xx_nucleo_bus.h"
#include "stm32n6xx_nucleo_xspi.h"
#include "stm32n6xx_nucleo.h"
#include "stm32_lcd.h"
#include "app_fuseprogramming.h"
#include "stm32_lcd_ex.h"
#include "app_postprocess.h"
#include "stai.h"
#include "stai_od.h"
#include "stai_reid.h"
#include "app_camerapipeline.h"
#include "main.h"
#include <stdio.h>
#include "app_config.h"
#include "stlogo.h"
#include "stm32ipl.h"

#define IPL_MEM_POOL_SIZE (64 * 1024)

#define LCD_BG_WIDTH  SCREEN_WIDTH
#define LCD_BG_HEIGHT SCREEN_HEIGHT
#define LCD_FG_WIDTH  SCREEN_WIDTH
#define LCD_FG_HEIGHT SCREEN_HEIGHT

#define LCD_FG_FRAMEBUFFER_SIZE  (LCD_FG_WIDTH * LCD_FG_HEIGHT * 2)

#define UTIL_LCD_COLOR_TRANSPARENT 0

#ifndef APP_GIT_SHA1_STRING
#define APP_GIT_SHA1_STRING "dev"
#endif
#ifndef APP_VERSION_STRING
#define APP_VERSION_STRING "unversioned"
#endif

#ifndef MIN
#define MIN(a,b) ((a) < (b) ? (a) : (b))
#endif
#ifndef MAX
#define MAX(a,b) ((a) > (b) ? (a) : (b))
#endif

typedef struct
{
  uint32_t X0;
  uint32_t Y0;
  uint32_t XSize;
  uint32_t YSize;
} Rectangle_TypeDef;

/* Lcd Background area */
Rectangle_TypeDef lcd_bg_area = {
#if ASPECT_RATIO_MODE == ASPECT_RATIO_CROP || ASPECT_RATIO_MODE == ASPECT_RATIO_FIT
  .X0 = (LCD_BG_WIDTH - LCD_BG_HEIGHT) / 2,
#else
  .X0 = 0,
#endif
  .Y0 = 0,
  .XSize = 0,
  .YSize = 0,
};

/* Lcd Foreground area */
Rectangle_TypeDef lcd_fg_area = {
#if ASPECT_RATIO_MODE == ASPECT_RATIO_CROP || ASPECT_RATIO_MODE == ASPECT_RATIO_FIT
  .X0 = (LCD_FG_WIDTH - LCD_FG_HEIGHT) / 2,
#else
  .X0 = 0,
#endif
  .Y0 = 0,
  .XSize = 0,
  .YSize = 0,
};

#define NUMBER_COLORS 10
const uint32_t colors[NUMBER_COLORS] = {
    UTIL_LCD_COLOR_GREEN,
    UTIL_LCD_COLOR_RED,
    UTIL_LCD_COLOR_CYAN,
    UTIL_LCD_COLOR_MAGENTA,
    UTIL_LCD_COLOR_YELLOW,
    UTIL_LCD_COLOR_GRAY,
    UTIL_LCD_COLOR_BLACK,
    UTIL_LCD_COLOR_BROWN,
    UTIL_LCD_COLOR_BLUE,
    UTIL_LCD_COLOR_ORANGE
};

#if POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V2_UI
  od_yolov2_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V5_UU
  od_yolov5_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_YOLO_V8_UI
  od_yolov8_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_ST_YOLOX_UI
  od_st_yolox_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_ST_SSD_UF
  od_ssd_st_pp_static_param_t pp_params;
#elif POSTPROCESS_TYPE == POSTPROCESS_OD_FD_BLAZEFACE_UI
  od_fd_blazeface_pp_static_param_t pp_params;
#else
  #error "PostProcessing type not supported"
#endif

UART_HandleTypeDef huart1;
volatile int32_t cameraFrameReceived;
stai_ptr nn_in;
void* pp_input;
od_pp_out_t pp_output;
od_pp_outBuffer_t out_buffer[AI_OD_YOLOV2_PP_MAX_BOXES_LIMIT];

#define DCMIPP_OUT_NN_BUFF_LEN ((STAI_OD_IN_1_WIDTH * STAI_OD_IN_1_CHANNEL) * STAI_OD_IN_1_HEIGHT)
__attribute__ ((section (".psram_bss")))
__attribute__ ((aligned (32)))
uint8_t dcmipp_out_nn[DCMIPP_OUT_NN_BUFF_LEN];


/* model */
STAI_NETWORK_CONTEXT_DECLARE(network_od_ctx, STAI_OD_CONTEXT_SIZE)
STAI_NETWORK_CONTEXT_DECLARE(network_reid_ctx, STAI_REID_CONTEXT_SIZE)
__attribute__ ((aligned (32)))
static uint8_t reid_features[APP_MAX_OBJECT_DETECT][NN_REID_NB_FEATURES];
/* Lcd Background Buffer */
__attribute__ ((aligned (32)))
static uint8_t lcd_bg_buffer[LCD_BG_WIDTH * LCD_BG_HEIGHT * 2];
/* Lcd Foreground Buffer */
__attribute__ ((aligned (32)))
static uint8_t lcd_fg_buffer[2][LCD_FG_WIDTH * LCD_FG_HEIGHT * 2];
static int lcd_fg_buffer_rd_idx;
/* screen buffer */
__attribute__ ((aligned (32)))
static uint8_t screen_buffer[LCD_FG_WIDTH * LCD_FG_HEIGHT * 2];

/* Ipl memory pool */
static uint8_t ipl_mem_pool[IPL_MEM_POOL_SIZE];

static void SystemClock_Config(void);
static void CONSOLE_Config(void);
static void NPURam_enable(void);
static void NPUCache_config(void);
static void Display_NetworkOutput(uint32_t inference_ms);
static void Display_init(void);
static void Security_Config(void);
static void set_clk_sleep_mode(void);
static void IAC_Config(void);
static void Display_WelcomeScreen(void);
static void Hardware_init(void);
static void Run_Inference(stai_network *network_instance,
                          stai_return_code (*run_inference)(stai_network *, const stai_run_mode),
                          stai_return_code (*new_inference)(stai_network *));
static void OdNeuralNetwork_init(stai_ptr *nn_out, stai_size *number_output, int32_t nn_out_len[]);
static void ReidNeuralNetwork_init(uint8_t **nn_in);
static int clamp(int v, int v_min, int v_max);
static void dbox_to_roi(od_pp_outBuffer_t *dbox, rectangle_t *roi, int w, int h);
static int app_compute_feature(od_pp_outBuffer_t *dbox, uint8_t *src_data, uint8_t *dst_data, uint8_t *features,
                               uint32_t *inference_ms);
static int app_compute_features(od_pp_out_t *pp_out, uint8_t *src_data, uint8_t *dst_data, uint32_t *inference_ms);

/**
  * @brief  Main program
  * @param  None
  * @retval None
  */
int main(void)
{
  Hardware_init();

  /*** App header *************************************************************/
  printf("========================================\n");
  printf("STM32N6-GettingStarted-ReIdentification %s (%s)\n", APP_VERSION_STRING, APP_GIT_SHA1_STRING);
  printf("Build date & time: %s %s\n", __DATE__, __TIME__);
  #if defined(__GNUC__)
  printf("Compiler: GCC %d.%d.%d\n", __GNUC__, __GNUC_MINOR__, __GNUC_PATCHLEVEL__);
#elif defined(__ICCARM__)
  printf("Compiler: IAR EWARM %d.%d.%d\n", __VER__ / 1000000, (__VER__ / 1000) % 1000 ,__VER__ % 1000);
#else
  printf("Compiler: Unknown\n");
#endif
  printf("HAL: %lu.%lu.%lu\n", __STM32N6xx_HAL_VERSION_MAIN, __STM32N6xx_HAL_VERSION_SUB1, __STM32N6xx_HAL_VERSION_SUB2);
  printf("STEdgeAI Tools: %d.%d.%d\n", STAI_TOOLS_VERSION_MAJOR, STAI_TOOLS_VERSION_MINOR, STAI_TOOLS_VERSION_MICRO);
  printf("NN model: %s\n", STAI_REID_ORIGIN_MODEL_NAME);
  printf("========================================\n");

  /*** NN Init ****************************************************************/
  uint32_t pitch_nn = 0;
  stai_size number_output = 0;
  stai_ptr nn_out[STAI_OD_OUT_NUM] = {0};
  int32_t nn_out_len[STAI_OD_OUT_NUM] = {0};
  stai_network_info info;
  uint32_t inference_ms;
  uint8_t *nn_reid_in;
  stai_ptr inputs[1];
  int ret;

