STMicroelectronics/STM32N6-GettingStarted-ReID/Application/NUCLEO-N657X0-Q/Src/main.c
  Hardware_init();
  STM32Ipl_InitLib(ipl_mem_pool, sizeof(ipl_mem_pool));

  /*** NN Init ****************************************************************/
  LL_ATON_RT_RuntimeInit();
  OdNeuralNetwork_init(nn_out, &number_output, nn_out_len);
  ReidNeuralNetwork_init(&nn_reid_in);

  /*** Post Processing Init ***************************************************/
  ret = stai_od_get_info(network_od_ctx, &info);
  assert(ret == STAI_SUCCESS);
  app_postprocess_init(&pp_params, &info);
  pp_output.pOutBuff = out_buffer;

  /*** Camera Init ************************************************************/
  CameraPipeline_Init((uint32_t *[2]) {&lcd_bg_area.XSize, &lcd_fg_area.XSize}, (uint32_t *[2]) {&lcd_bg_area.YSize, &lcd_fg_area.YSize}, &pitch_nn);

  Display_init();

  /* Start LCD Display camera pipe stream */
  CameraPipeline_DisplayPipe_Start(lcd_bg_buffer, CMW_MODE_CONTINUOUS);

  /*** App Loop ***************************************************************/
  while (1)
  {
    CameraPipeline_IspUpdate();

    /* Start NN camera single capture Snapshot */
    CameraPipeline_NNPipe_Start(dcmipp_out_nn, CMW_MODE_SNAPSHOT);

    while (cameraFrameReceived == 0) {};
    cameraFrameReceived = 0;

    /* run ATON inference */
    inputs[0] = dcmipp_out_nn;
    ret = stai_od_set_inputs(network_od_ctx, inputs, 1);
    Run_Inference(network_od_ctx, stai_od_run, stai_ext_od_new_inference);

    ret = app_postprocess_run((void **) nn_out, number_output, &pp_output, &pp_params);
    assert(ret == 0);
    /* Discard nn_out region (used by pp_input and pp_outputs variables) to avoid Dcache evictions during nn inference */
    for (int i = 0; i < number_output; i++)
    {
      void *tmp = nn_out[i];
      SCB_InvalidateDCache_by_Addr(tmp, nn_out_len[i]);
    }

    /* Run re-id model for each detected box */
    ret = app_compute_features(&pp_output, dcmipp_out_nn, nn_reid_in, &inference_ms);
    assert(ret == 0);

    /* Maintain track objects */
    TrackObject_UpdateAll(&pp_output, reid_features);

    /* Display UI */
    Display_NetworkOutput(inference_ms);
  }
}

static int clamp(int v, int v_min, int v_max)
{
  return MAX(MIN(v, v_max), v_min);
}

static void dbox_to_roi(od_pp_outBuffer_t *dbox, rectangle_t *roi, int w, int h)
{
  int x_ul;
  int y_ul;
  int x_br;
  int y_br;

  x_ul = (dbox->x_center - dbox->width / 2) * w;
  y_ul = (dbox->y_center - dbox->height / 2) * h;
  x_br = (dbox->x_center + dbox->width / 2) * w;
  y_br = (dbox->y_center + dbox->height / 2) * h;
  x_ul = clamp(x_ul, 0, w - 1);
  y_ul = clamp(y_ul, 0, h - 1);
  x_br = clamp(x_br, 0, w - 1);
  y_br = clamp(y_br, 0, h - 1);

  roi->x = x_ul;
  roi->y = y_ul;
  roi->w = x_br - x_ul + 1;
  roi->h = y_br - y_ul + 1;
}

static int app_compute_feature(od_pp_outBuffer_t *dbox, uint8_t *src_data, uint8_t *dst_data, uint8_t *features,
                               uint32_t *inference_ms)
{
  stai_ptr outputs[1];
  rectangle_t src_roi;
  uint32_t ts;
  image_t src;
  image_t dst;
  int ret;

  /* Don't keep dbox asptect ratio */
  dbox_to_roi(dbox, &src_roi, NN_WIDTH, NN_HEIGHT);
  STM32Ipl_Init(&src, NN_WIDTH, NN_HEIGHT, IMAGE_BPP_RGB888, src_data);
  STM32Ipl_Init(&dst, STAI_REID_IN_1_WIDTH, STAI_REID_IN_1_HEIGHT, IMAGE_BPP_RGB888, dst_data);
  ret = STM32Ipl_Resize_Roi(&src, &src_roi, &dst, NULL, RESIZE_BILINEAR);
  if (ret)
  {
    return ret;
  }
  SCB_CleanDCache_by_Addr(dst_data, DCMIPP_OUT_NN_BUFF_LEN);

  /* Run reid model */
  ts = HAL_GetTick();
  SCB_InvalidateDCache_by_Addr(features, NN_REID_NB_FEATURES);
  outputs[0] = features;
  ret = stai_reid_set_outputs(network_reid_ctx, outputs, 1);
  assert(ret == STAI_SUCCESS);
  Run_Inference(network_reid_ctx, stai_reid_run, stai_ext_reid_new_inference);
  *inference_ms =  HAL_GetTick() - ts;

  return 0;
}

static int app_compute_features(od_pp_out_t *pp_out, uint8_t *src_data, uint8_t *dst_data, uint32_t *inference_ms)
{
  uint32_t inf_ms;
  int ret;
  int i;

  *inference_ms = 0;
  /* Run resize + reid model for each detected box */
  for (i = 0; i < pp_out->nb_detect; i++)
  {
    ret = app_compute_feature(&pp_out->pOutBuff[i], src_data, dst_data, reid_features[i], &inf_ms);
    if (ret)
    {
      return ret;
    }
    *inference_ms += inf_ms;
  }
  *inference_ms = pp_out->nb_detect ? (*inference_ms / pp_out->nb_detect) : 0;

  return 0;
}

static void Hardware_init(void)
{
  /* Power on ICACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_ICACTIVE_Msk;

  /* Set back system and CPU clock source to HSI */
  __HAL_RCC_CPUCLK_CONFIG(RCC_CPUCLKSOURCE_HSI);
  __HAL_RCC_SYSCLK_CONFIG(RCC_SYSCLKSOURCE_HSI);

  HAL_Init();

  SCB_EnableICache();

#if defined(USE_DCACHE)
  /* Power on DCACHE */
  MEMSYSCTL->MSCR |= MEMSYSCTL_MSCR_DCACTIVE_Msk;
  SCB_EnableDCache();
#endif

  SystemClock_Config();

  CONSOLE_Config();

  NPURam_enable();

  Fuse_Programming();

  NPUCache_config();

  /*** External NOR Flash *********************************************/
  BSP_XSPI_NOR_Init_t NOR_Init;
  NOR_Init.InterfaceMode = BSP_XSPI_NOR_OPI_MODE;
  NOR_Init.TransferRate = BSP_XSPI_NOR_DTR_TRANSFER;
  BSP_XSPI_NOR_Init(0, &NOR_Init);
  BSP_XSPI_NOR_EnableMemoryMappedMode(0);

  /* Set all required IPs as secure privileged */
  Security_Config();

  IAC_Config();
  set_clk_sleep_mode();

}

static void Run_Inference(stai_network *network_instance, stai_return_code (*run_inference)(stai_network *, const stai_run_mode),
                          stai_return_code (*new_inference)(stai_network *))
{
  stai_return_code ret;

  do {
    ret = run_inference(network_instance, STAI_MODE_ASYNC);
    if (ret == STAI_RUNNING_WFE)
      LL_ATON_OSAL_WFE();
  } while (ret == STAI_RUNNING_WFE || ret == STAI_RUNNING_NO_WFE);

  ret = new_inference(network_instance);
  assert(ret == STAI_SUCCESS);
}

static void OdNeuralNetwork_init(stai_ptr *nn_out, stai_size *number_output, int32_t nn_out_len[])
{
  stai_network_info info;
  int ret;

  /* init model instance */
  ret = stai_od_init(network_od_ctx);
  assert(ret == STAI_SUCCESS);

  ret = stai_od_get_info(network_od_ctx, &info);
  assert(ret == STAI_SUCCESS);
  assert(info.n_inputs == 1);
  *number_output = STAI_OD_OUT_NUM;

  /* Get the input buffer size & address */
  ret = stai_od_get_inputs(network_od_ctx, &nn_in, (stai_size *)&info.n_inputs);
  assert(ret == STAI_SUCCESS);

  /* Get the output buffers size & address */
  ret = stai_od_get_outputs(network_od_ctx, nn_out, number_output);
  assert(ret == STAI_SUCCESS);
  for (int i = 0; i < *number_output; i++)
  {
    nn_out_len[i] = info.outputs[i].size_bytes;
  }
}

static void ReidNeuralNetwork_init(uint8_t **nn_in)
{
  stai_size n_inputs;
  stai_ptr inputs;
  int ret;

  /* init model instance */
  ret = stai_reid_init(network_reid_ctx);
  assert(ret == STAI_SUCCESS);

  /* Fetch input location */
  ret = stai_reid_get_inputs(network_reid_ctx, &inputs, &n_inputs);
  assert(ret == STAI_SUCCESS);

  *nn_in = inputs;
}

static void NPURam_enable(void)
{
  __HAL_RCC_NPU_CLK_ENABLE();
  __HAL_RCC_NPU_FORCE_RESET();
  __HAL_RCC_NPU_RELEASE_RESET();

  /* Enable NPU RAMs (4x448KB) */
  __HAL_RCC_AXISRAM3_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_ENABLE();
  __HAL_RCC_RAMCFG_CLK_ENABLE();
  RAMCFG_HandleTypeDef hramcfg = {0};
  hramcfg.Instance =  RAMCFG_SRAM3_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM4_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM5_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
  hramcfg.Instance =  RAMCFG_SRAM6_AXI;
  HAL_RAMCFG_EnableAXISRAM(&hramcfg);
}

static void set_clk_sleep_mode(void)
{
  /*** Enable sleep mode support during NPU inference *************************/
  /* Configure peripheral clocks to remain active during sleep mode */
  /* Keep all IP's enabled during WFE so they can wake up CPU. Fine tune
   * this if you want to save maximum power
   */
  __HAL_RCC_XSPI1_CLK_SLEEP_ENABLE();    /* For display frame buffer */
  __HAL_RCC_XSPI2_CLK_SLEEP_ENABLE();    /* For NN weights */
  __HAL_RCC_NPU_CLK_SLEEP_ENABLE();      /* For NN inference */
  __HAL_RCC_CACHEAXI_CLK_SLEEP_ENABLE(); /* For NN inference */
  __HAL_RCC_DMA2D_CLK_SLEEP_ENABLE();    /* For display */
  __HAL_RCC_DCMIPP_CLK_SLEEP_ENABLE();   /* For camera configuration retention */
  __HAL_RCC_CSI_CLK_SLEEP_ENABLE();      /* For camera configuration retention */

  __HAL_RCC_FLEXRAM_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM1_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM2_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM3_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM4_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM5_MEM_CLK_SLEEP_ENABLE();
  __HAL_RCC_AXISRAM6_MEM_CLK_SLEEP_ENABLE();
}

